import java.util.Scanner;

/*
Задача №11: Ввод строки с клавиатуры Задание
        Необходимо произвести ввод строки с клавиатуры и записать в строковую переменную.
        Результат вывести на экран.
*/
public class Task11 {
    public static void main(String[] args) {
        Scanner r = new Scanner(System.in);
        String s = r.nextLine();
        System.out.println(s);
    }
}
