/*
Задача №8: Цикличный вывод данных на экранЗадание
        Необходимо с помощью цикла вывести на экран числа от 1 до 50.
*/
public class Task8 {
    public static void main(String[] args) {
        int i;
        for (i = 1; i <= 50; i++) {
            System.out.println(i);
        }
    }
}
